app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1

  def create
    @project = Project.new(params[:project])
    if @project.save
---
INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES ('2013-12-12 22:50:48.279741', 'deneme', '2013-12-12 22:50:48.279741')

  def edit
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1

  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(params[:project])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1
UPDATE "projects" SET "name" = 'BelkızTarla', "updated_at" = '2013-12-13 02:52:24.063780' WHERE ("projects"."id" = 1)