app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task])
    if @task.save
---
INSERT INTO "tasks" ("completed_at", "created_at", "name", "project_id", "updated_at") VALUES ('2013-10-14 00:00:00.000000', '2013-12-13 02:53:00.432028', 'Zeytin Toplama', 1, '2013-12-13 02:53:00.432028')

  def edit
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE ("tasks"."id" = 1) LIMIT 1

  def update
    @task = Task.find(params[:id])
    if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE ("tasks"."id" = 1) LIMIT 1
UPDATE "tasks" SET "name" = 'Üzüm Hasatı', "updated_at" = '2013-12-13 04:19:22.503679' WHERE ("tasks"."id" = 3)